tests/fixtures/OrderTriggerManualCaptureResponse.json

{
    "address": {
        "billing": {
            "city": "Hamburg",
            "countryCode": "DEU",
            "id": 7353,
            "isDefault": {
                "billing": false,
                "shipping": false
            },
            "recipient": {
                "firstName": "Anna!",
                "gender": "m",
                "lastName": "Fohlmeister",
                "type": "personal"
            },
            "street": "test",
            "zipCode": "1200"
        },
        "shipping": {
            "city": "Hamburg",
            "collectionPoint": {
                "customerKey": "bced-234-234",
                "description": "Pedros Kiosk",
                "key": "12345-a",
                "type": "hermes_parcelshop"
            },
            "countryCode": "DEU",
            "houseNumber": "10",
            "id": 7354,
            "isDefault": {
                "billing": false,
                "shipping": false
            },
            "recipient": {
                "firstName": "Anna!",
                "gender": "m",
                "lastName": "Fohlmeister",
                "type": "personal"
            },
            "referenceKey": "InGidcPDmL8fGkv02a3sSAgAr7ySMBfa66iw4MriYgUNI3Boq369rBOZW3stlKLWSqIjB2dXCGNbCxoM5Xww4cI8cULUoGBFJHH0",
            "street": "Domstrasse",
            "zipCode": "20459"
        }
    },
    "basketKey": "imported-basket",
    "confirmedAt": "2018-01-20T11:30:15+00:00",
    "contacts": [
        {
            "type": "carrier"
        }
    ],
    "cost": {
        "appliedFees": [
            {
                "amount": {
                    "withTax": 200,
                    "withoutTax": 168
                },
                "category": "delivery",
                "key": "least_packages",
                "option": "deliveryCosts",
                "tax": {
                    "vat": {
                        "amount": 32,
                        "rate": 0.19
                    }
                }
            }
        ],
        "costCapture": 1390,
        "tax": {
            "vat": {
                "amount": 222
            }
        },
        "withTax": 1390,
        "withTaxWithMembershipDiscountWithoutServiceCosts": 1190,
        "withoutTax": 1168,
        "withoutTaxWithMembershipDiscount": 1168
    },
    "createdAt": "2018-01-20T09:30:15+00:00",
    "currencyCode": "EUR",
    "legacyCustomData": {
        "key": "value",
        "origin": "data-importer"
    },
    "customer": {
        "createdAt": "2021-11-29T16:39:02+00:00",
        "email": "ada75@hotmail.com",
        "firstName": "Sylvia",
        "gender": "m",
        "groups": [
            "new",
            "initial-data"
        ],
        "id": 1,
        "lastName": "McCullough",
        "publicKey": "customer-a5666d13bcadd56342da3644681e96c0",
        "referenceKey": "InGidcPDmL8fGkv02a3sSAgAr7ySMBfa66iw4MriYgUNI3Boq369rBOZW3stlKLWSqIjB2dXCGNbCxoM5Xww4cI8cULUoGBFJHH0",
        "status": {
            "isActive": true,
            "isGuestCustomer": false
        },
        "title": "Dr.",
        "type": "personal",
        "updatedAt": "2021-12-03T10:58:37+00:00"
    },
    "detailedStatus": {
        "billing": {
            "code": "billing_payment_pending",
            "name": "Zahlung reserviert"
        },
        "order": {
            "code": "order_delegated",
            "name": "Delegated"
        },
        "shipping": {
            "code": "shipping_delivered",
            "name": "Ware versendet"
        }
    },
    "id": 901,
    "items": [
        {
            "createdAt": "2018-01-20T09:30:15+00:00",
            "currency": "EUR",
            "legacyCustomData": {
                "key": "value"
            },
            "id": 10976510,
            "key": "e3f0643cd35403f954828e745797260b",
            "merchant": {
                "referenceKey": "m1"
            },
            "packageId": 45,
            "price": {
                "overrideWithTax": 0,
                "overrideWithoutTax": 0,
                "tax": {
                    "vat": {
                        "amount": 190,
                        "rate": 0.19
                    }
                },
                "undiscountedWithOutTax": 1000,
                "undiscountedWithTax": 1190,
                "withTax": 1190,
                "withoutTax": 1000
            },
            "product": {
                "id": 4564545
            },
            "status": "delivered",
            "variant": {
                "id": 1234567,
                "referenceKey": "563843898",
                "stock": {
                    "supplierId": 1
                }
            }
        }
    ],
    "packages": [
        {
            "deliveryDate": {
                "maximum": "2018-02-05",
                "minimum": "2018-02-05"
            },
            "deliveryStatus": "shipment_completed",
            "id": 45,
            "shipmentKey": "shpmnt-61-1",
            "tracking": {
                "id": "shpmnt-61-1"
            }
        }
    ],
    "payment": [
        {
            "amount": 1190,
            "data": {
                "CCBrand": "VISA",
                "CCExpiry": "202005",
                "IPCity": "charlottenburg",
                "IPLatitude": "52.5151",
                "IPLongitude": "13.3053",
                "IPState": "berlin",
                "IPZone": "276",
                "IPZoneA2": "de"
            },
            "key": "accounting",
            "transactionKey": "creditcard-abcde"
        }
    ],
    "publicKey": "666",
    "referenceKey": "InGidcPDmL8fGkv02a3sSAgAr7ySMBfa66iw4MriYgUNI3Boq369rBOZW3stlKLWSqIjB2dXCGNbCxoM5Xww4cI8cULUoGBFJU2",
    "shipping": {
        "deliveryCosts": 200,
        "expressDeliveryCosts": 0,
        "policy": "least_packages"
    },
    "status": "payment_reserved",
    "updatedAt": "2018-01-20T09:30:15+00:00",
    "vouchers": [
        {
            "applicableItems": [
                {
                    "isApplied": false,
                    "key": "e3f0643cd35403f954828e745797260b"
                }
            ],
            "code": "fashion2020",
            "id": 346,
            "type": "relative",
            "value": 1000,
            "voucherId": 0
        }
    ],
    "shopCountry": {
        "id": 5502,
        "shopKey": "msde",
        "countryCode": "DE",
        "defaultLanguageCode": "en_GB",
        "supportedLanguageCodes": [],
        "priceGroupKey": null,
        "url": "www.example.com",
        "active": true,
        "currencyCode": null,
        "deleted": false
    }
}